Ran Apply for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of telmate/proxmox from the dependency lock file
- Using previously-installed telmate/proxmox v3.0.1-rc3

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

proxmox_lxc.test_atlantis: Refreshing state... [id=pve/lxc/109]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # proxmox_lxc.test-lxc-2 will be created
  + resource "proxmox_lxc" "test-lxc-2" {
      + arch         = "amd64"
      + cmode        = "tty"
      + console      = true
      + cores        = 2
      + cpulimit     = 0
      + cpuunits     = 1024
      + hostname     = "test-lxc-2"
      + id           = (known after apply)
      + memory       = 512
      + onboot       = false
      + ostemplate   = "local:vztmpl/debian-12-standard_12.2-1_amd64.tar.zst"
      + ostype       = (known after apply)
      + protection   = false
      + start        = false
      + swap         = 512
      + tags         = (known after apply)
      + target_node  = "pve"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 110

      + features {
          + fuse    = false
          + keyctl  = false
          + mknod   = false
          + nesting = true
        }

      + network {
          + bridge = "vmbr0"
          + hwaddr = (known after apply)
          + id     = (known after apply)
          + ip     = "dhcp"
          + name   = "eth0"
          + tag    = (known after apply)
          + trunks = (known after apply)
          + type   = (known after apply)
        }
      + network {
          + bridge = "vmbr1"
          + hwaddr = (known after apply)
          + id     = (known after apply)
          + ip     = "10.0.1.110/24"
          + name   = "eth1"
          + tag    = (known after apply)
          + trunks = (known after apply)
          + type   = (known after apply)
        }

      + rootfs {
          + size    = "4G"
          + storage = "local-lvm"
          + volume  = (known after apply)
        }
    }

  # proxmox_lxc.test_atlantis will be updated in-place
  ~ resource "proxmox_lxc" "test_atlantis" {
        id                   = "pve/lxc/109"
        # (25 unchanged attributes hidden)

      ~ network {
            id       = 1
          ~ ip       = "10.0.1.109/24" -> "10.0.1.111/24"
            name     = "eth1"
            # (7 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
proxmox_lxc.test-lxc-2: Creating...
proxmox_lxc.test_atlantis: Modifying... [id=pve/lxc/109]
proxmox_lxc.test_atlantis: Modifications complete after 0s [id=pve/lxc/109]
proxmox_lxc.test-lxc-2: Creation complete after 6s [id=pve/lxc/110]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
```

</details>